; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v10 ?v12)
             (pred_8 ?v1 ?v11)
             (pred_1 ?v10 ?v11)
             (pred_10 ?v7 ?v10 )
	     (pred_12 ?v10)
             (pred_2 ?v5)
             (pred_11 ?v1)
             (pred_6 ?v11)
             (pred_7 ?v10)
             (pred_3 ?v1)
             (pred_4 ?v10)
             (pred_5 ))



(:action op_1
:parameters (?v8 ?v6 ?v2 ?v4)
:precondition (and (pred_2 ?v8) (pred_2 ?v6) (pred_11 ?v2) (pred_6 ?v4)
          (pred_9 ?v8 ?v6) (pred_8 ?v2 ?v4)
                   (pred_1 ?v6 ?v4) (pred_12 ?v8) 
                   (pred_7 ?v6) (pred_3 ?v2))
:effect (and  (pred_4 ?v6) (not (pred_7 ?v6))))


(:action op_2
:parameters (?v8 ?v3)
:precondition (and (pred_2 ?v8) (pred_2 ?v3)
               (pred_12 ?v8) (pred_9 ?v8 ?v3) (pred_4 ?v3))
:effect (and (pred_12 ?v3) (not (pred_12 ?v8))))

(:action op_4
:parameters (?v8 ?v2)
:precondition (and (pred_2 ?v8) (pred_11 ?v2) 
                  (pred_12 ?v8) (pred_10 ?v2 ?v8) (pred_5 ))
:effect (and (pred_3 ?v2)
   (not (pred_10 ?v2 ?v8)) (not (pred_5 ))))


(:action op_3
:parameters (?v8 ?v9 ?v13)
:precondition (and (pred_2 ?v8) (pred_11 ?v9) (pred_11 ?v13)
                  (pred_12 ?v8) (pred_3 ?v13) (pred_10 ?v9 ?v8))
:effect (and (pred_3 ?v9) (pred_10 ?v13 ?v8)
        (not (pred_3 ?v13)) (not (pred_10 ?v9 ?v8))))

(:action op_5
:parameters (?v8 ?v2)
:precondition (and (pred_2 ?v8) (pred_11 ?v2) 
                  (pred_12 ?v8) (pred_3 ?v2))
:effect (and (pred_5 ) (pred_10 ?v2 ?v8) (not (pred_3 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_02 obj_09 obj_14 obj_16 obj_01 obj_13 obj_20 obj_06 obj_15 obj_07 obj_08 obj_18 obj_05 obj_11 obj_12
    obj_04 obj_10
    obj_17 obj_03
    )

    (:init
       (pred_5)

       (pred_2 obj_19)
       (pred_2 obj_02)
       (pred_2 obj_09)
       (pred_2 obj_14)
       (pred_2 obj_16)
       (pred_2 obj_01)
       (pred_2 obj_13)
       (pred_2 obj_20)
       (pred_2 obj_06)
       (pred_2 obj_15)
       (pred_2 obj_07)
       (pred_2 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_05)
       (pred_2 obj_11)
       (pred_2 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_10)
       (pred_11 obj_17)
       (pred_11 obj_03)

       (pred_9 obj_19 obj_16)
       (pred_9 obj_19 obj_02)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_19)
       (pred_9 obj_09 obj_13)
       (pred_9 obj_09 obj_14)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_14 obj_20)
       (pred_9 obj_14 obj_09)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_16 obj_19)
       (pred_9 obj_01 obj_15)
       (pred_9 obj_01 obj_13)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_01 obj_16)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_13 obj_20)
       (pred_9 obj_13 obj_09)
       (pred_9 obj_13 obj_01)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_20 obj_13)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_06 obj_15)
       (pred_9 obj_06 obj_16)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_15 obj_07)
       (pred_9 obj_15 obj_01)
       (pred_9 obj_15 obj_06)
       (pred_9 obj_07 obj_11)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_15)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_18 obj_05)
       (pred_9 obj_18 obj_06)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_05 obj_18)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_11 obj_07)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_12 obj_11)
       (pred_7 obj_09)
       (pred_7 obj_05)
       (pred_1  obj_09 obj_04)
       (pred_1  obj_05 obj_10)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_4 obj_14)
       (pred_4 obj_16)
       (pred_4 obj_01)
       (pred_4 obj_13)
       (pred_4 obj_20)
       (pred_4 obj_06)
       (pred_4 obj_15)
       (pred_4 obj_07)
       (pred_4 obj_08)
       (pred_4 obj_18)
       (pred_4 obj_11)
       (pred_4 obj_12)

       (pred_8  obj_17 obj_04)
       (pred_8  obj_03 obj_10)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_03 obj_07)
       (pred_12 obj_16)
    )

    (:goal (and
       (pred_10 obj_17 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_02)))
)
)

; plan
1. (op_2 obj_16 obj_06)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_06)
   goals met: 0 of 1
2. (op_2 obj_06 obj_18)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_18)
   goals met: 0 of 1
3. (op_4 obj_18 obj_17)
   deleted: (pred_10 obj_17 obj_18) (pred_5)
   added: (pred_3 obj_17)
   goals met: 0 of 1
4. (op_2 obj_18 obj_06)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_06)
   goals met: 0 of 1
5. (op_2 obj_06 obj_16)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_16)
   goals met: 0 of 1
6. (op_2 obj_16 obj_01)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_01)
   goals met: 0 of 1
7. (op_2 obj_01 obj_13)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_13)
   goals met: 0 of 1
8. (op_1 obj_13 obj_09 obj_17 obj_04)
   deleted: (pred_7 obj_09)
   added: (pred_4 obj_09)
   goals met: 0 of 1
9. (op_2 obj_13 obj_09)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_09)
   goals met: 0 of 1
10. (op_5 obj_09 obj_17)
   deleted: (pred_3 obj_17)
   added: (pred_5) (pred_10 obj_17 obj_09)
   goals met: 1 of 1
